<template>
  <div class="about">
      <h2>Vite & vue 3 todos app</h2>
      <div>
          <p><strong>Что такое список задач?</strong> Очень просто!<strong><em> Это список дел, которые надо завершить
              или которые вы хотите сделать</em>.</strong>
          </p>
          <p>
              Если вы запишете свои планы и задачи в одном месте, то скорее всего ничего не попустите и выполните всё задуманное в том порядке, в котором запишете и всегда будете знать, что еще осталось сделать.
          </p>
          <p>
              Записать свои планы и задачи в список поможет организовать время и внимание на достижении цели шаг за шагом. Список позволяет контролировать свое время. Четкий распорядок и представление о том, что еще осталось сделать сэкономят ваши силы и внимание. А когда все задачи уже реализованы, вы можете  сфокуссироваться на более творческих целях!
          </p>
          <p>
              Если задача завершена и зачеркнута в вашем списке, это дает ощущение прогресса и повышает уверенность в себе. Плюс ко всему это побуждает на вс новые свершения и достижение больших высот!
          </p>
          <h3 class="wish">Успехов!</h3>
      </div>
  </div>
</template>

<style>
.about {
    display: flex;
    flex-direction: column;
    align-items: center;
    max-width: 90%;
    min-height: 100vh;
    margin-top: 48px;
    padding: 24px;
}

h2 {
    color: #41b080;
}

p {
    margin-top: 16px;
    text-align: center;
    line-height: 1.5;
}
.wish {
    margin-top: 16px;
    text-align: center;
    color: #41b080;
}

@media (min-width: 1024px) {
    h2 {
        margin-bottom: 24px;
    }

    p {
        line-height: 1.5;
    }
}
</style>
